import numpy as np

a = np.array(
    [
        [1, 2, 3, 4],
        [5, 6, 7, 8],
        [9, 10, 11, 12],
        [13, 14, 15, 16],
    ]
)
b = a.T
print(b)
# [[ 1  5  9 13]
#  [ 2  6 10 14]
#  [ 3  7 11 15]
#  [ 4  8 12 16]]

c = a @ b
print(c)
# [[ 30  70 110 150]
#  [ 70 174 278 382]
#  [110 278 446 614]
#  [150 382 614 846]]
print("*" * 50)


# ---------------------------------------------------------------------#
# a拆行,b拆列
# 横着拆矩阵的话只需要自己和自己的转置以及另一部分的转置相乘拼接才是结果
# ---------------------------------------------------------------------#
a1 = a[:2]
print(a1)
# [[1 2 3 4]
#  [5 6 7 8]]
a2 = a[2:]
print(a2)
# [[ 9 10 11 12]
#  [13 14 15 16]]

# 左上
print(a1 @ a1.T)
# [[ 30  70]
#  [ 70 174]]

# 右上
print(a1 @ a2.T)
# [[110 150]
#  [278 382]]

# 左下
print(a2 @ a1.T)
# [[110 278]
#  [150 382]]

# 右下
print(a2 @ a2.T)
# [[446 614]
#  [614 846]]


print(
    np.concatenate(
        [
            np.concatenate(
                [a1 @ a1.T, a1 @ a2.T], axis=1
            ),  # 列在axis=1拼接,行在axis=0拼接
            np.concatenate([a2 @ a1.T, a2 @ a2.T], axis=1),
        ],
        axis=0,
    )
    == a @ b
)
# [[ True  True  True  True]
#  [ True  True  True  True]
#  [ True  True  True  True]
#  [ True  True  True  True]]
print("*" * 50)


# ---------------------------------------------------------------------#
# a不拆,b拆列
# 把b竖着拆开的话，a再分别和它俩相乘得到左右各一半结果，拼接即可
# ---------------------------------------------------------------------#
b1 = b[:, :2]
b2 = b[:, 2:]
print(a @ b1)
# [[ 30  70]
#  [ 70 174]
#  [110 278]
#  [150 382]]
print(a @ b2)
# [[110 150]
#  [278 382]
#  [446 614]
#  [614 846]]
print(np.concatenate([a @ b1, a @ b2], axis=1) == a @ b)
# [[ True  True  True  True]
#  [ True  True  True  True]
#  [ True  True  True  True]
#  [ True  True  True  True]]
print("*" * 50)


# ---------------------------------------------------------------------#
# a拆列,b拆行(必须，否则无法相乘)
# 竖着拆矩阵的话只需要自己和自己的转置相乘再相加就是原结果
# ---------------------------------------------------------------------#
a3 = a[:, :2]
print(a3)
# [[ 1  2]
#  [ 5  6]
#  [ 9 10]
#  [13 14]]
a4 = a[:, 2:]
print(a4)
# [[ 3  4]
#  [ 7  8]
#  [11 12]
#  [15 16]]

print(a3 @ a3.T)
# [[  5  17  29  41]
#  [ 17  61 105 149]
#  [ 29 105 181 257]
#  [ 41 149 257 365]]

print(a4 @ a4.T)
# [[ 25  53  81 109]
#  [ 53 113 173 233]
#  [ 81 173 265 357]
#  [109 233 357 481]]

print(a3 @ a3.T + a4 @ a4.T == a @ b)
# [[ True  True  True  True]
#  [ True  True  True  True]
#  [ True  True  True  True]
#  [ True  True  True  True]]
