import numpy as np
import torch

"""
[:, 0]   代表第0维度全取,第1维取下标为0的
[..., 0] 代表前面的维度全取,最后的维度取下标为0的
"""


a = np.arange(6).reshape(2, 3)
print(a)
# [[0 1 2]
#  [3 4 5]]

print(a[:, 0])      # 对于二维数据, [:, 0] [..., 0] 效果相同
# [0 3]
print(a[..., 0])
# [0 3]
print("*" * 20)

b = torch.from_numpy(a)
print(b)
# [[0 1 2]
#  [3 4 5]]

print(b[:, 0])
# [0 3]
print(b[..., 0])
# [0 3]
print("*" * 20)


a = np.arange(12).reshape(2, 2, 3)
print(a)
# [[[ 0  1  2]
#   [ 3  4  5]]
#  [[ 6  7  8]
#   [ 9 10 11]]]

print(a[:, 0])      # 对于多维数据, [:, 0] [..., 0] 效果不同
# [[0 1 2]          # [:, 0] 取的第1维度下标为0的数据
#  [6 7 8]]
print(a[..., 0])
# [[0 3]            # [..., 0] 取的最后维度下标为0的数据
#  [6 9]]
print("*" * 20)

b = torch.from_numpy(a)
print(b)
# [[[ 0  1  2]
#   [ 3  4  5]]
#  [[ 6  7  8]
#   [ 9 10 11]]]

print(b[:, 0])
# [[0 3]
#  [6 9]]

print(b[..., 0])
# [[0 3]
#  [6 9]]